app/views/movies/show.html.erb

SELECT  "movies".* FROM "movies" WHERE "movies"."api_id" = ? LIMIT ?  [["api_id", "166426"], ["LIMIT", 1]]
---
        <%= render template: 'ratings/_rating_stars', locals: { rateable: { id: @movie.id, type: 'Movie' }} %>
          <% movie_ratings = Movie.find_by(api_id: @movie.id) %>