app/controllers/reviews_controller.rb

SELECT  "movies".* FROM "movies" WHERE (1) LIMIT ?  [["LIMIT", 1]]
SELECT "reviews".* FROM "reviews"
---
def index
  @movie = Movie.find_by(params[:movie_id])
  @reviews = Review.all

SELECT  "movies".* FROM "movies" WHERE "movies"."api_id" = ? LIMIT ?  [["api_id", "166426"], ["LIMIT", 1]]
INSERT INTO "movies" ("api_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["api_id", "166426"], ["created_at", "2017-06-23 03:41:02.489060"], ["updated_at", "2017-06-23 03:41:02.489060"]]
---
def new
  @movie = Movie.find_by(api_id: params[:movie_id])
  if !@movie
   @movie = Movie.create({api_id: params[:movie_id]})

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 166426], ["LIMIT", 1]]
INSERT INTO "reviews" ("title", "body", "user_id", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "cxvxc"], ["body", "czxvzcv"], ["user_id", 1], ["movie_id", 1], ["created_at", "2017-06-23 03:45:26.983201"], ["updated_at", "2017-06-23 03:45:26.983201"]]
---
def create
  @movie = Movie.find(params[:movie_id])
  @review = Review.new(reviews_params)
  if @review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
def show
  @movie = Movie.get_by_id(params[:movie_id])
  @review = Review.find(params[:id])

SELECT  "movies".* FROM "movies" WHERE "movies"."api_id" = ? LIMIT ?  [["api_id", "166426"], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
def edit
  @movie = Movie.find_by(api_id: params[:movie_id])
  @review = Review.find(params[:id])

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "movies".* FROM "movies" WHERE "movies"."api_id" = ? LIMIT ?  [["api_id", "166426"], ["LIMIT", 1]]
UPDATE "reviews" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["title", "cxvxc sfda"], ["body", "czxvzcva sfd"], ["updated_at", "2017-06-23 19:20:39.938749"], ["id", 2]]
---
def update
  @review = Review.find(params[:id])
  @movie = Movie.find_by(api_id: params[:movie_id])
  if @review.update(reviews_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."api_id" = ? LIMIT ?  [["api_id", "166426"], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]
---
def destroy
  @movie = Movie.find_by(api_id: params[:movie_id])
  @review = Review.find(params[:id])
  @review.destroy