app/controllers/reviews_controller.rb

def create
  @movie = Movie.find_by(api_id: params[:movie_id].to_i)
  @review = Review.new(movie_id: @movie.id, user_id: session[:id], title: reviews_params[:title], body: reviews_params[:body])
  if @review.save
---
SELECT  "movies".* FROM "movies" WHERE "movies"."api_id" = ? LIMIT ?  [["api_id", "166426"], ["LIMIT", 1]]
INSERT INTO "movies" ("api_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["api_id", "166426"], ["created_at", "2017-06-23 02:28:48.718163"], ["updated_at", "2017-06-23 02:28:48.718163"]]

def show
  @movie = Movie.get_by_id(params[:movie_id])
  @review = Movie.find_by(api_id: params[:movie_id]).reviews.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."api_id" = ? LIMIT ?  [["api_id", "166426"], ["LIMIT", 1]]