app/controllers/reviews_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 166426], ["LIMIT", 1]]
---
def new
  @movie = Movie.find(1)