app/views/reviews/show.html.erb

<%= link_to "delete", "/movies/#{@movie.id}/reviews/#{@review.id}", method: :delete %>
<h3>Movie rating Avg: <%= average_ratings(Movie.find_by(api_id: @movie.id).ratings) %> </h3>
---
SELECT  "movies".* FROM "movies" WHERE "movies"."api_id" = ? LIMIT ?  [["api_id", "166426"], ["LIMIT", 1]]

<ul>
  <% @review.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."review_id" = ?  [["review_id", 1]]